{
  "common": {
    "name": "open-meteo-weather",
    "version": "2.2.2",
    "news": {
      "2.2.2": {
        "en": "fix: update js-controller and admin dependencies to latest versions\nfix: add missing responsive breakpoints in jsonConfig\nfix: Chinese translations files & correct import path for Chinese translations\nfix: add missing translation for precipitation probability to the translations\nfix: Adjusted the creation of hourly state icons to account for day/night conditions.\nadd: Added debug logs to track the execution flow and data processing for better traceability.\nEnhance performance and readability by caching translations, unit maps, and imperial settings.\nRefactor icon retrieval methods for wind direction and moon phases, optimize cleanup logic for deleted locations, improve state creation and updating with consistent translation handling.",
        "de": "fix: update von js-controller und adminabhängigkeiten auf neueste versionen\nfix: Hinzufügen fehlender reaktionsschneller Breakpoints in jsonConfig\nfix: Chinesische Übersetzungen Dateien & korrekter Importpfad für chinesische Übersetzungen\nfix: fügen sie fehlende übersetzung für die fällungswahrscheinlichkeit zu den übersetzungen hinzu\nfix: Die Erstellung von stündlichen Zustandssymbolen angepasst, um Tag/Nacht-Bedingungen zu berücksichtigen.\nadd: Debug-Logs hinzugefügt, um den Ausführungsablauf und die Datenverarbeitung für eine bessere Rückverfolgbarkeit zu verfolgen.\nVerbessern Sie die Leistung und Lesbarkeit durch Cache-Übersetzungen, Unit-Karten und imperiale Einstellungen.\nRefactor-Icon-Retrieval-Methoden für Windrichtung und Mondphasen, Optimieren Sie die Aufräumlogik für gelöschte Standorte, verbessern Sie die Zustandserstellung und aktualisieren Sie mit konsequentem Übersetzungshandling.",
        "ru": "исправление: обновление js-контроллера и зависимостей администратора в последних версиях\nисправить: добавить недостающие адаптивные точки останова в jsonConfig\nисправление: файлы китайских переводов и правильный путь импорта для китайских переводов\nисправить: добавить недостающий перевод для вероятности осадков к переводам\nисправление: скорректировано создание почасовых государственных икон для учета условий дня / ночи.\nдобавлены журналы отладки для отслеживания потока выполнения и обработки данных для лучшей прослеживаемости.\nПовышение производительности и читаемости путем кэширования переводов, карт единиц и имперских настроек.\nРефакторные методы поиска значков для ветровой и лунной фаз, оптимизация логики очистки для удаленных мест, улучшение создания состояния и обновление с последовательной обработкой перевода.",
        "pt": "corrigir: atualizar js-controller e dependências de administração para versões mais recentes\ncorreção: adicionar pontos de paragem em falta no jsonConfig\ncorreção: arquivos de traduções chinesas e caminho de importação correto para traduções chinesas\ncorrigir: adicionar tradução faltando para probabilidade de precipitação para as traduções\ncorreção: Ajustou a criação de ícones de estado horário para contabilizar as condições do dia/noite.\nadd: Adicionado registros de depuração para rastrear o fluxo de execução e processamento de dados para melhor rastreabilidade.\nMelhore o desempenho e a legibilidade através do cache de traduções, mapas unitários e configurações imperiais.\nMétodos de recuperação de ícones de refator para as fases de direção do vento e lua, otimizar a lógica de limpeza para locais excluídos, melhorar a criação de estado e atualização com o manuseio consistente da tradução.",
        "nl": "fix: update js-controller en admin afhankelijkheden van de nieuwste versies\nfix: voeg ontbrekende responsieve breekpunten in jsonConfig toe\nfix: Chinese vertalingen bestanden en juiste import pad voor Chinese vertalingen\nfix: voeg ontbrekende vertaling voor neerslag waarschijnlijkheid aan de vertalingen\nfix: De aanmaak van pictograms per uur aangepast om rekening te houden met dag-/nachtomstandigheden.\nadd: Toegevoegd debug logs om de uitvoering stroom en gegevensverwerking te volgen voor een betere traceerbaarheid.\nVerbeter de prestaties en leesbaarheid door caching vertalingen, eenheidskaarten en keizerlijke instellingen.\nRefactor pictogram retrieval methoden voor windrichting en maanfasen, optimaliseren opruimlogica voor verwijderde locaties, verbeteren staat creatie en bijwerken met consistente vertaling handling.",
        "fr": "correction: mettre à jour js-controller et les dépendances administratives aux dernières versions\ncorrection : ajouter des points d'arrêt réactifs manquants dans jsonConfig\ncorrection: fichiers de traductions chinoises & chemin d'importation correct pour les traductions chinoises\ncorrection: ajouter la traduction manquante pour la probabilité de précipitation aux traductions\ncorrection : Ajusté la création d'icônes de l'état horaire pour tenir compte des conditions de jour/nuit.\najouter: Ajout de journaux de débogage pour suivre le flux d'exécution et le traitement des données pour une meilleure traçabilité.\nAméliorer les performances et la lisibilité en cachant les traductions, les cartes unitaires et les paramètres impériaux.\nRefactor méthodes de récupération d'icônes pour la direction du vent et les phases de lune, optimiser la logique de nettoyage pour les emplacements supprimés, améliorer la création d'état et la mise à jour avec la gestion cohérente de la traduction.",
        "it": "correzione: aggiornamento js-controller e dipendenze di amministrazione alle ultime versioni\nfix: aggiungere i breakpoint mancanti in jsonConfig\nfix: Traduzioni cinesi file e corretto percorso di importazione per traduzioni cinesi\ncorrezione: aggiungere la traduzione mancante per la probabilità di precipitazioni alle traduzioni\nfix: Regolata la creazione di icone di stato oraria per tenere conto delle condizioni di giorno/notte.\naggiungere: Aggiunti tronchi debug per monitorare il flusso di esecuzione e l'elaborazione dei dati per una migliore tracciabilità.\nMigliorare le prestazioni e la leggibilità tramite traduzioni di cache, mappe unità e impostazioni imperiali.\nI metodi di recupero dell'icona del refattore per la direzione del vento e le fasi lunari, ottimizzare la logica di pulizia per le posizioni eliminate, migliorare la creazione dello stato e l'aggiornamento con la gestione coerente della traduzione.",
        "es": "fijación: actualización js-controller y dependencias de administración a las últimas versiones\nfijación: añadir puntos de rotura no deseados en jsonConfig\nfijación: traducciones chinas archivos \" camino de importación correcto para traducciones chinas\nsolución: añadir traducción faltante para la probabilidad de precipitación a las traducciones\nfijación: Ajustó la creación de iconos de estado por hora para tener en cuenta las condiciones del día/noche.\nañadir: Registros de depuración añadidos para rastrear el flujo de ejecución y el procesamiento de datos para una mejor trazabilidad.\nMejorar el rendimiento y la legibilidad mediante traducciones de caché, mapas de unidad y ajustes imperiales.\nRefactor icono métodos de recuperación para la dirección eólica y fases lunares, optimizar la lógica de limpieza para ubicaciones eliminadas, mejorar la creación del estado y actualizar con el manejo de traducción consistente.",
        "pl": "fix: update js- controller i zależności admin do najnowszych wersji\nfix: dodaj brakujące punkty zwrotne w jsonConfig\nfix: Chińskie tłumaczenia plików i poprawna ścieżka importu dla chińskich tłumaczeń\nfix: dodać brak tłumaczenia na prawdopodobieństwo opadów do tłumaczenia\nfix: Dostosował tworzenie ikon stanu godzinowego do warunków dnia / nocy.\ndodaj: Dodano logi debugowania do śledzenia przepływu wykonania i przetwarzania danych dla lepszej identyfikowalności.\nZwiększenie wydajności i czytelności poprzez buforowanie tłumaczeń, map jednostkowych i ustawień imperialnych.\nRefactor metody pobierania ikon dla kierunku wiatru i fazy Księżyca, zoptymalizować logikę czyszczenia dla usuniętych lokalizacji, poprawić tworzenie stanu i aktualizację ze spójną obsługą tłumaczenia.",
        "uk": "виправити: оновити js-controller і адміністратор залежності до останніх версій\nвиправити: додати відсутні чуйні точки розриву в jsonConfig\nвиправити: Китайські переклади файлів та правильний шлях імпорту для китайських перекладів\nвиправити: додавати відсутній переклад для ймовірності опадів до перекладів\nфіксувати: регулювати створення часових державних ікон до облікового запису на день / нічні умови.\nдодати: Додано дебвугові колоди для відстеження потоку виконання та обробки даних для кращої мікроелементності.\nПідвищення продуктивності та читабельності за допомогою кешування перекладів, блокових карт та налаштування імперських.\nРефакторні іконки ретривальні методи для вітрового напрямку та місячних фази, оптимізують логіку очищення для видалених локацій, покращують стан створення та оновлення з послідовним перекладом.",
        "zh-cn": "固定: 更新 js 控制器和对最新版本的依赖性\n固定: 在 jsonConfig 中添加缺失的响应断点\n修补:中文翻译文件及中文翻译的正确导入路径\n修补: 在翻译中添加缺少的降水概率翻译\n固定 : 调整了小时状态图标的创建,以反映日/夜条件.\n加:添加调试日志以跟踪执行流程和数据处理,以更好的可追溯性.\n通过缓存翻译、单位地图和帝国设置提高性能和可读性.\n重构风向和月相的图标检索方法,优化被删除位置的清理逻辑,改进状态创建,并采用一致的翻译处理方式进行更新."
      },
      "2.2.1": {
        "en": "fix: Correct quotation marks for relative humidity translation in French",
        "de": "fix: Richtige Anführungszeichen für relative Luftfeuchtigkeit Übersetzung auf Französisch",
        "ru": "правильные кавычки для перевода относительной влажности на французский язык",
        "pt": "correção: Aspas corretas para a tradução de umidade relativa em francês",
        "nl": "fix: Correcte aanhalingstekens voor relatieve vochtigheid vertaling in het Frans",
        "fr": "correctif: correct guillemets pour la traduction d'humidité relative en français",
        "it": "correzione: Corretto segno di quotazione per la traduzione relativa di umidità in francese",
        "es": "fijado: Marcas de citas correctas para la traducción de humedad relativa en francés",
        "pl": "fix: Prawidłowe znaki cytowania dla tłumaczenia wilgotności względnej w języku francuskim",
        "uk": "виправити: Правильні оцінки цін на відносний переклад вологості французьким",
        "zh-cn": "fix: 法文相对湿度翻译的正确引号"
      },
      "2.2.0": {
        "en": "add unit translations for improved localization in weather data\nadd additional pollen units and translations to unit maps\nadd carbon monoxide, dust, olive pollen, and ozone in air quality & translations\nrefactor weather data fetching to use constants for parameter keys\nremove unused dependencies and scripts\nadd image for wind warning",
        "de": "einheitsübersetzungen für eine verbesserte lokalisierung in wetterdaten hinzufügen\nzusätzliche polleneinheiten und übersetzungen zu einheitskarten hinzufügen\nkohlenmonoxid, staub, olivenpollen und ozon in luftqualität & übersetzungen hinzufügen\nrefactor wetterdaten fetching, um konstanten für parameterschlüssel zu verwenden\nungenutzte abhängigkeiten und skripte entfernen\nbild für windwarnung hinzufügen",
        "ru": "добавить единичные переводы для улучшения локализации данных о погоде\nдобавить дополнительные единицы пыльцы и переводы на карты единиц\nдобавить окись углерода, пыль, оливковую пыльцу и озон в качество воздуха и переводы\nрефактор данных о погоде, использующий константы для ключей параметров\nудалить неиспользуемые зависимости и скрипты\nдобавить изображение для предупреждения о ветре",
        "pt": "adicionar traduções de unidade para melhor localização em dados meteorológicos\nadicionar unidades de pólen adicionais e traduções para mapas unitários\nadicionar monóxido de carbono, poeira, pólen de azeitona e ozônio na qualidade do ar e traduções\nrefator dados meteorológicos buscando para usar constantes para chaves de parâmetros\nremover dependências e scripts não utilizados\nadicionar imagem para aviso de vento",
        "nl": "toe te voegen eenheid vertalingen voor verbeterde localisatie in weersgegevens\nvoeg extra stuifmeeleenheden en vertalingen toe aan eenheidskaarten\ntoevoegen van koolmonoxide, stof, olijfpollen en ozon in luchtkwaliteit & vertalingen\nrefactor weersgegevens ophalen om constanten voor parametersleutels te gebruiken\nongebruikte afhankelijkheden en scripts verwijderen\nafbeelding toevoegen voor windwaarschuwing",
        "fr": "ajouter des traductions unitaires pour améliorer la localisation des données météorologiques\najouter des unités de pollen supplémentaires et des traductions aux cartes des unités\najouter monoxyde de carbone, poussière, pollen d'olive et ozone dans la qualité de l'air & traductions\nrefactor données météorologiques récupérées pour utiliser des constantes pour les touches de paramètre\nsupprimer les dépendances et les scripts inutilisés\najouter une image pour l'avertissement du vent",
        "it": "aggiungere traduzioni di unità per una migliore localizzazione dei dati meteo\naggiungere ulteriori unità di polline e traduzioni alle mappe unità\naggiungere monossido di carbonio, polvere, polline di oliva e ozono nella qualità dell'aria & traduzioni\nrefactor dati meteo cattura per utilizzare costanti per le chiavi dei parametri\nrimuovere dipendenze e script non utilizzati\naggiungere l'immagine per avviso di vento",
        "es": "añadir traducciones unitarias para mejorar la localización en datos meteorológicos\nañadir unidades adicionales de polen y traducciones a mapas unitarios\nañadir monóxido de carbono, polvo, polen de oliva y ozono en la calidad del aire \"\nrefactor datos meteorológicos para utilizar constantes para claves de parámetro\neliminar dependencias y scripts no utilizados\nañadir imagen para alerta de viento",
        "pl": "dodaj tłumaczenia jednostek w celu poprawy lokalizacji w danych pogodowych\ndodać dodatkowe jednostki pyłkowe i tłumaczenia do map jednostkowych\ndodać tlenek węgla, pył, pyłek oliwny i ozon w jakości powietrza i tłumaczenia\nprzestawianie pobierania danych pogodowych na stałe dla klawiszy parametrów\nusunąć niewykorzystane zależności i skrypty\ndodaj obraz do ostrzeżenia przed wiatrem",
        "uk": "додавати переклади блоків для поліпшення локалізації в погодних даних\nдодати додаткові блоки і переклади на карти блоків\nдодати оксид вуглецю, пил, оливковий пилок та озону в якості повітря та перекладах\nрефакторний потік даних для використання констанцій для ключів параметрів\nвидалення невикористаних залежностей і сценаріїв\nдодати зображення для попередження вітру",
        "zh-cn": "增加单位翻译,以改善天气数据的本地化\n在单位地图中增加额外的花粉单位和翻译\n在空气质量和翻译中加入一氧化碳、粉尘、橄榄花粉和臭氧\n重构获取参数键使用常数的天气数据\n删除未使用的依赖和脚本\n为风警告添加图像"
      },
      "2.1.0": {
        "en": "add module suncalc\nadd Moon Phase value, text and icon url datapoints \nadd Moon Phase icons \nadd translations for Moon Phases\nChanged location for weather icons for better overview",
        "de": "modul suncalc hinzufügen\nhinzufügen Mond Phasenwert, Text und Icon url datapoints\nhinzufügen Mond Phasensymbole\nübersetzungen für Mondphasen hinzufügen\nÄnderte Lage für Wettersymbole für bessere Übersicht",
        "ru": "добавить модуль suncalc\nдобавить луну Значение фазы, текст и иконка URL точек данных\nдобавить луну Иконки фазы\nпереводы для лунных фаз\nИзмененное местоположение иконок погоды для лучшего обзора",
        "pt": "adicionar módulo suncalc\nadicionar Lua Valor de fase, pontos de dados url de texto e ícone\nadicionar Lua Ícones de fase\nadicionar traduções para as Fases da Lua\nLocalização alterada para ícones meteorológicos para uma melhor visão geral",
        "nl": "module suncalc toevoegen\nmaan toevoegen Fasewaarde, tekst en pictogram url-gegevenspunten\nmaan toevoegen Fasepictogrammen\nvertalingen voor maanfasen toevoegen\nVeranderde locatie voor weerpictogrammen voor een beter overzicht",
        "fr": "ajouter le module suncalc\najouter Lune Valeur de phase, texte et point de données url icon\najouter Lune Icônes de phase\najouter des traductions pour Phases de Lune\nEmplacement modifié pour les icônes météo pour un meilleur aperçu",
        "it": "aggiungere modulo suncalc\naggiungi Luna Valore di fase, punti dati del testo e dell'icona\naggiungi Luna Icone di fase\naggiungere le traduzioni per le fasi lunari\nPosizione modificata per le icone meteo per una migliore panoramica",
        "es": "añadir módulo suncalc\nañadir Moon Puntos de datos url de valor de fase, texto e icono\nañadir Moon Iconos de fase\nañadir traducciones para Fase de la Luna\nCambio de ubicación para iconos meteorológicos para una mejor vista general",
        "pl": "dodaj moduł suncalc\ndodaj Księżyc Wartość fazowa, tekst i ikona punktów danych url\ndodaj Księżyc Ikony fazy\ndodaj tłumaczenia dla Moon Fases\nZmieniona lokalizacja ikon pogodowych dla lepszego przeglądu",
        "uk": "додати модуль solarc\nдодати Місяць Фази значення, текстові та значкові точки даних\nдодати Місяць Фази ікони\nдодавати переклади для Moon Phases\nЗміна розташування для метеорологічних ікон для кращого огляду",
        "zh-cn": "添加模块太阳算法\n添加月亮 阶段值、 文本和图标url 数据点\n添加月亮 阶段图标\n为月球相位添加翻译\n更改天气图标位置, 以更好地进行概览"
      },
      "2.0.1": {
        "en": "Fix wind direction icons",
        "de": "Icons der Windrichtung fixieren",
        "ru": "Исправьте иконки направления ветра",
        "pt": "Corrigir os ícones de direção do vento",
        "nl": "Windrichtingpictogrammen herstellen",
        "fr": "Correction des icônes de direction du vent",
        "it": "Fissare le icone della direzione del vento",
        "es": "Fijar iconos de dirección del viento",
        "pl": "Napraw ikony kierunku wiatru",
        "uk": "Виправлення значків напрямку вітру",
        "zh-cn": "修整风向图标"
      },
      "2.0.0": {
        "en": "Major Feature: Migrated to a dynamic table-based location management (multi-location support).\nMajor Feature: Implemented smart recursive cleanup logic for objects (locations, days, hours, air quality).\nImproved UI visibility for coordinates link.",
        "de": "Hauptmerkmal: Migration auf ein dynamisches tabellenbasiertes Standortmanagement (Multi-Location-Unterstützung).\nMajor Feature: Implementierte intelligente rekursive Aufräumlogik für Objekte (Standorte, Tage, Stunden, Luftqualität).\nVerbesserte UI Sichtbarkeit für Koordinatenlink.",
        "ru": "Основная функция: миграция в динамическое управление местоположением на основе таблицы (поддержка нескольких местоположений).\nОсновная особенность: реализована интеллектуальная рекурсивная логика очистки объектов (локации, дни, часы, качество воздуха).\nУлучшенная видимость UI для связи координат.",
        "pt": "Característica principal: Migrado para uma gestão dinâmica de localização baseada em tabelas (suporte multi-localização).\nCaracterística principal: Lógica de limpeza recursiva inteligente implementada para objetos (localizações, dias, horas, qualidade do ar).\nMaior visibilidade da interface para o link de coordenadas.",
        "nl": "Belangrijke functie: Migreren naar een dynamisch tabel-gebaseerde locatiebeheer (multi-locatie ondersteuning).\nBelangrijke functie: Implementeerde slimme recursieve opruimlogica voor objecten (locaties, dagen, uren, luchtkwaliteit).\nVerbeterde zichtbaarheid van de UI voor coördinatenlink.",
        "fr": "Élément majeur : Migré à une gestion dynamique de l'emplacement basée sur une table (soutien multi-emplacements).\nÉlément majeur : Mise en œuvre d'une logique intelligente de nettoyage récursif pour les objets (emplacements, jours, heures, qualité de l'air).\nAmélioration de la visibilité de l'interface utilisateur pour le lien de coordonnées.",
        "it": "Caratteristica principale: Migrato a una gestione dinamica della posizione basata su tavolo (supporto multi-location).\nCaratteristica principale: logica di pulizia ricorsiva intelligente implementata per oggetti (locazioni, giorni, ore, qualità dell'aria).\nMigliore visibilità dell'interfaccia utente per il collegamento delle coordinate.",
        "es": "Principales características: Migrado a una gestión dinámica de ubicación basada en tablas (apoyo de ubicación múltiple).\nCaracterísticas principales: Aplicada lógica de limpieza recursiva inteligente para objetos (ubicaciones, días, horas, calidad del aire).\nMayor visibilidad de la interfaz de usuario para enlaces de coordenadas.",
        "pl": "Major Feature: Migrated to a dynamic table- based location management (multi- location support).\nGłówne cechy: Wdrożenie inteligentnej rekursywnej logiki oczyszczania obiektów (lokalizacje, dni, godziny, jakość powietrza).\nUlepszona widoczność UI dla łącza współrzędnych.",
        "uk": "Основна особливість: Міграція до динамічного управління розташуванням таблиці (багатоканальна підтримка).\nОсновна особливість: Реалізована смарт-рекурсивна логіка для об'єктів (локації, дні, години, якість повітря).\nПокращена видимість UI для координати посилання.",
        "zh-cn": "主要特性: 迁移到动态基于表格的位置管理(多位置支持).\n主要特征:对物体(位置,天数,小时,空气质量)实施智能递归清理逻辑.\n提高坐标链接的UI能见度."
      },
      "1.2.1": {
        "en": "Fix settings for adapter checker",
        "de": "Fixe Einstellungen für den Adapter-Checker",
        "ru": "Исправлены настройки для проверки адаптера",
        "pt": "Correções nas configurações do verificador de adaptadores",
        "nl": "Fix voor instellingen voor adapterchecker",
        "fr": "Correction des paramètres pour le verificateur d'adaptateur",
        "it": "Correzioni per le impostazioni per il verificatore di adapter",
        "es": "Correcciones para el verificador de adaptadores",
        "pl": "Poprawki w ustawieniach sprawdzania adapterów",
        "uk": "Виправлення налаштувань для перевірки адаптера",
        "zh-cn": "修复适配器检查器的设置"
      }
    },
    "titleLang": {
      "en": "Open-Meteo Weather Service",
      "de": "Open-Meteo Wetterdienst",
      "ru": "Прогноз погоды Open-Meteo",
      "pt": "Serviço de Meteorologia Open-Meteo",
      "nl": "Open-Meteo weerdienst",
      "fr": "Service météo Open-Meteo",
      "it": "Servizio meteo Open-Meteo",
      "es": "Servicio Meteorológico Open-Meteo",
      "pl": "Serwis pogodowy Open-Meteo",
      "uk": "Метеорологічна служба Open-Meteo",
      "zh-cn": "Open-Meteo 天气服务"
    },
    "desc": {
      "en": "Get local weather, air quality and pollen data from Open-Meteo.com",
      "de": "Lokale Wetter-, Luftqualitäts- und Pollenflugdaten von Open-Meteo.com abrufen",
      "ru": "Получайте данные о местной погоде, качестве воздуха и пыльце с сайта Open-Meteo.com",
      "pt": "Obtenha dados meteorológicos locais, qualidade do ar e pólen de Open-Meteo.com",
      "nl": "Ontvang lokale weers-, luchtkwaliteits- en pollengegevens van Open-Meteo.com",
      "fr": "Obtenez les prévisions météo locales, la qualité de l'air et les données sur le pollen d'Open-Meteo.com",
      "it": "Ottieni meteo locale, qualità dell' dell'aria e dati sui pollini da Open-Meteo.com",
      "es": "Obtenga datos meteorológicos locales, calidad del aire y polen de Open-Meteo.com",
      "pl": "Pobieraj lokalne dane pogodowe, jakość powietrza i dane o pyłkach z Open-Meteo.com",
      "uk": "Отримуйте дані про місцеву погоду, якість повітря та пилок з Open-Meteo.com",
      "zh-cn": "从 Open-Meteo.com 获取当地天气、空气质量 and 花粉数据"
    },
    "authors": [
      "H5N1v2 <h5n1@iknox.de>"
    ],
    "keywords": [
      "weather",
      "forecast",
      "open-meteo",
      "pollen",
      "air quality"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "type": "weather",
    "mode": "daemon",
    "platform": "Javascript/Node.js",
    "icon": "open-meteo.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/H5N1v2/ioBroker.open-meteo-weather/main/admin/open-meteo.png",
    "readme": "https://github.com/H5N1v2/ioBroker.open-meteo-weather/blob/main/README.md",
    "loglevel": "info",
    "tier": 3,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "latitude": 51.34,
    "longitude": 12.37,
    "interval": 30,
    "pollenEnabled": true,
    "airQualityEnabled": false,
    "language": "de",
    "forecastDays": 1,
    "forecastHours": 1,
    "forecastHoursEnabled": false,
    "locations": []
  }
}
