{
  "common": {
    "name": "open-meteo-weather",
    "version": "2.4.1",
    "news": {
      "2.4.1": {
        "en": "chore: update dependencies to latest versions.\nadd link to Widget in instanz configuration.",
        "de": "chore: aktualisieren abhängigkeiten auf neueste versionen.\nlink zu Widget in in instanz Konfiguration hinzufügen.",
        "ru": "chore: обновление зависимостей до последних версий.\nдобавить ссылку на Widget в конфигурации instanz.",
        "pt": "tarefa: atualizar dependências para versões mais recentes.\nadicionar link ao Widget na configuração do instanz.",
        "nl": "klus: update afhankelijkheden van de nieuwste versies.\nlink naar Widget toevoegen in instanz configuratie.",
        "fr": "core: mettre à jour les dépendances aux dernières versions.\najouter un lien vers Widget en configuration Instanz.",
        "it": "core: aggiornare le dipendenze alle ultime versioni.\naggiungere link a Widget in configurazione instanz.",
        "es": "coro: actualizar las dependencias a las últimas versiones.\nañadir enlace a Widget en configuración instanz.",
        "pl": "core: aktualizacja zależności do najnowszych wersji.\ndodaj link do Widget w konfiguracji instanz.",
        "uk": "chore: оновлення залежності до останніх версій.\nдодати посилання на Widget в конфігурації instanz.",
        "zh-cn": "chore:更新对最新版本的依赖性.\n在Instanz配置中添加链接."
      },
      "2.4.0": {
        "en": "fix: adjust moon phase calculation for accurate phase key assignment\nchore: update dependencies\nAdded option to choose between wind direction (destination) and wind origin (source) icons in Admin.\nNew subfolder structure for alternative wind icons (direct_2).",
        "de": "fix: mondphasenberechnung für genaue phasenschlüsselzuweisung einstellen\nchore: abhängigkeiten aktualisieren\nOption hinzugefügt, um zwischen Windrichtung (Destination) und Wind Herkunft (Quelle) Icons in Admin zu wählen.\nNeue Unterordnerstruktur für alternative Windsymbole (direct_2).",
        "ru": "исправление: корректировка расчета фазы луны для точного назначения ключа фазы\nchore: зависимость от обновлений\nДобавлена опция выбора между иконками направления ветра (назначения) и происхождения ветра (источника) в Admin.\nНовая структура подпапки для альтернативных иконок ветра (direct_2).",
        "pt": "correção: ajustar o cálculo da fase da lua para a atribuição precisa da chave da fase\ntarefa: atualizar dependências\nAdicionada opção para escolher entre direção do vento (destino) e ícones de origem do vento (fonte) no Admin.\nNova estrutura de subpastas para ícones de vento alternativos (direct_2).",
        "nl": "fix: aanpassing maan fase berekening voor nauwkeurige fase sleutel toewijzing\nklus: update afhankelijkheden\nToegevoegd optie om te kiezen tussen windrichting (bestemming) en wind herkomst (bron) pictogrammen in Admin.\nNieuwe submappenstructuur voor alternatieve windpictogrammen (direct_2).",
        "fr": "correctif: ajuster le calcul de la phase de lune pour l'attribution précise de la clé de phase\ncore: mise à jour des dépendances\nAjout d'une option pour choisir entre la direction du vent (destination) et l'origine du vent (source) icônes dans Admin.\nNouvelle structure de sous-dossier pour les icônes de vent alternatives (direct_2).",
        "it": "correzione: regolare il calcolo della fase lunare per l'assegnazione accurata delle chiavi di fase\ncore: aggiornamento dipendenze\nAggiunta opzione per scegliere tra direzione del vento (destinazione) e icone di origine del vento (fonte) in Admin.\nNuova struttura sottocartelle per icone eoliche alternative (direct_2).",
        "es": "fijación: ajuste el cálculo de fase lunar para una asignación precisa de claves de fase\ncoro: dependencias de actualización\nOpción agregada para elegir entre la dirección del viento (destinación) y el origen del viento (fuente) iconos en Admin.\nNueva estructura de subcarpeta para iconos de viento alternativos (direct_2).",
        "pl": "fix: dostosować obliczenia fazy księżycowej dla dokładnego przypisania klucza fazy\ncore: update dependences\nDodano opcję wyboru między kierunkiem wiatru (docelowym) a ikonami pochodzenia wiatru (źródłowym) w Administracji.\nNowa struktura podfolderu dla alternatywnych ikon wiatrowych (direct _ 2).",
        "uk": "виправити: налаштувати розрахунок фази місяця для точного завдання фази\nchore: оновлення залежності\nДодана можливість вибрати між вітровим напрямком (випадання) і вітровим походженням (джерело) ікони в Admin.\nНова структура підпаперів для альтернативних значків вітру (direct_2).",
        "zh-cn": "固定:为精确的相键任务调整月相计算\n字符串:更新依赖关系\n在Admin中添加了选择风向(命运)和风源(源)图标的选项.\n替代风力图标的新子文件夹结构( direct_2)."
      },
      "2.3.0": {
        "en": "Added: Daily air quality & pollen aggregation (configurable 1, 3, or 6 days).\nAdded: Human-readable text mapping for pollen levels (None, Low, Moderate, High).\nAdded: Weekday names (name_day) for air quality forecast days.\nChanged: Optimized object tree – only daily peak values are stored instead of bulky hourly data.\nChanged: Improved cleanup logic – obsolete forecast objects are automatically removed.",
        "de": "Hinzugefügt: Tägliche Luftqualität & Pollenaggregation (konfigurierbar 1, 3, oder 6 Tage).\nHinzugefügt: Human lesbare Text-Mapping für Pollen-Level (Nein, Low, Moderate, High).\nHinzugefügt: Weekday-Namen (name_day) für die Luftqualität Vorhersage Tage.\nGeändert: Optimierter Objektbaum – anstelle von sperrigen Stundendaten werden nur tägliche Spitzenwerte gespeichert.\nGeändert: Verbesserte Aufräumlogik – veraltete Prognoseobjekte werden automatisch entfernt.",
        "ru": "Ежедневное качество воздуха и агрегация пыльцы (настраиваемые 1, 3 или 6 дней).\nДобавлено: Человеческое текстовое отображение для уровней пыльцы (ни один, низкий, умеренный, высокий).\nДобавлено: Названия дней недели (name_day) для прогнозируемых дней качества воздуха.\nИзменилось: Оптимизированное дерево объектов — вместо громоздких почасовых данных хранятся только суточные пиковые значения.\nИзменилось: Улучшенная логика очистки - устаревшие прогнозируемые объекты автоматически удаляются.",
        "pt": "Adicionado: Qualidade diária do ar e agregação de pólen (configurável 1, 3 ou 6 dias).\nAdicionado: Mapeamento de texto legível por humanos para níveis de pólen (Nenhum, Baixo, Moderado, Alto).\nAdicionado: Nomes de semana (nome_dia) para dias de previsão da qualidade do ar.\nAlterado: Árvore de objetos otimizada – apenas os valores de pico diários são armazenados em vez de dados horários volumosos.\nAlterado: Lógica de limpeza melhorada – objetos de previsão obsoletos são removidos automaticamente.",
        "nl": "Toegevoegd: dagelijkse luchtkwaliteit & pollenaggregatie (configureerbare 1, 3 of 6 dagen).\nToegevoegd: Menselijk leesbare tekst mapping voor pollenniveaus (Geen, Laag, Matig, Hoog).\nToegevoegd: Weekdag namen (name_day) voor de luchtkwaliteit voorspelling dagen.\nGewijzigd: Geoptimaliseerde object boom .\nGewijzigd: Verbeterde opschoningslogica De verouderde voorspellingobjecten worden automatisch verwijderd.",
        "fr": "Ajouté: Qualité de l'air quotidienne et agrégation du pollen (configurable 1, 3 ou 6 jours).\nAjout : cartographie textuelle lisible par l'homme pour les niveaux de pollen (Aucun, Faible, Modéré, Élevé).\nAjouté : Noms en semaine (nom_jour) pour les jours de prévision de la qualité de l'air.\nChangement : Arbre d'objets optimisé – seules les valeurs maximales quotidiennes sont stockées au lieu de données horaires volumineuses.\nChangement : Amélioration de la logique de nettoyage – les objets de prévision obsolètes sont automatiquement supprimés.",
        "it": "Aggiunto: Daily air quality & pollen aggregation (configurabile 1, 3, o 6 giorni).\nAggiunto: Human-readable text mapping per i livelli di polline (None, Low, Moderate, High).\nAggiunto: Weekday names (name_day) per i giorni di previsione di qualità dell'aria.\nCambiato: Albero di oggetti ottimizzato – solo i valori di picco giornalieri vengono memorizzati al posto dei dati orari ingombranti.\nCambiato: Migliore logica di pulizia – gli oggetti previsionali obsoleti vengono rimossi automaticamente.",
        "es": "Añadido: Calidad diaria del aire & agregación de polen (configurable 1, 3, o 6 días).\nAñadido: Cartografía de texto legible por humanos para niveles de polen (None, Low, Moderate, High).\nAñadido: Nombres semanales (nombre_día) para días de pronóstico de calidad del aire.\nCambio: Árbol de objeto optimizado - sólo los valores máximos diarios se almacenan en lugar de datos voluminosos por hora.\nCambio: Lógica de limpieza mejorada – objetos de pronóstico obsoletos se eliminan automáticamente.",
        "pl": "Dodano: Dzienna jakość powietrza i agregacja pyłków (konfigurowalne 1, 3 lub 6 dni).\nDodano: Mapowanie tekstu do odczytu ludzkiego dla poziomów pyłków (None, Low, Moderate, High).\nDodano: Tygodniowe nazwy (name _ day) dla dni prognozowania jakości powietrza.\nZmieniono: Zoptymalizowane drzewo obiektów - zamiast dużych danych godzinowych przechowywane są tylko dzienne wartości szczytowe.\nZmieniono: Ulepszona logika czyszczenia - przestarzałe obiekty prognozowania są automatycznie usuwane.",
        "uk": "Додано: Щоденна якість повітря та агрегатація забруднених речовин (налаштувати 1, 3, або 6 днів).\nДодано: Випробувано текстове картографування для рівня пилки (не, низький, помірний, високий).\nДодано: Щоденні імена (name_day) для прогнозування якості повітря.\nЗмінено: Оптимізоване дерево об'єкта – тільки добові пікові значення зберігаються замість об'ємних часових даних.\nЗмінено: Удосконалена логіка очищення – автоматично видаляються застарілі прогнозні об’єкти.",
        "zh-cn": "添加:每日空气质量和花粉聚合(配置1,3或6天).\n添加:用于花粉水平(无,低,中,高)的人类可读文本映射.\n新增:空气质量预报日的周名(名称_天).\n已更改 : 优化对象树 — 仅存储日峰值而不是大块小时数据.\n已更改 : 改进后的清理逻辑 – 过时的预测对象会被自动删除."
      },
      "2.2.5": {
        "en": "Nitrogen dioxide (NO2) datapoint added to the air quality data, user request.\nAdded new datapoints for \"global_tilted_irradiance\" & \"et0_fao_evapotranspiration\" in hourlyX and \"et0_fao_evapotranspiration_sum\" in dailyX.\nSome Log-messages translated in main.ts\nCorrected setStateAsync to setState in main.ts\nfix: update forecast hours handling.\nAdded an info folder with a last_update data point to check when the last update was performed.",
        "de": "Stickstoffdioxid (NO2) Datenpunkt zu den Luftqualitätsdaten hinzugefügt, Benutzeranfrage.\nNeue Datenpunkte für \"global_tilted_irradiance\" & \"et0_fao_evapotranspiration\" in stündlichX und \"et0_fao_evapotranspiration_sum\" in dailyX hinzugefügt.\nEinige Log-Nachrichten übersetzt in main.ts\nKorrigiert setStateAsync, umState in main.ts festzulegen\nfix: aktualisierung der vorausschätzungszeiten.\nEs wurde ein Info-Ordner mit einem letzten_update-Datenpunkt hinzugefügt, um zu überprüfen, wann das letzte Update durchgeführt wurde.",
        "ru": "Точка данных диоксида азота (NO2) добавлена к данным о качестве воздуха, запрос пользователя.\nДобавлены новые точки данных для \"global_tilted_irradiance\" и \"et0_fao_evapotranspiration\" в hourlyX и \"et0_fao_evapotranspiration_sum\" в dailyX.\nЛог-сообщения, переведенные на main.ts\nИсправленный setStateAsync установит State in main.ts\nобновление прогноза часов обработки.\nДобавлена папка с информацией с точкой данных last_update, чтобы проверить, когда было выполнено последнее обновление.",
        "pt": "Ponto de dados do dióxido de azoto (NO2) adicionado aos dados da qualidade do ar, pedido do utilizador.\nAdicionados novos pontos de dados para \"global_tilted_irradiance\" & \"et0_fao_evapotranspiration\" em cada horaX e \"et0_fao_evapotranspiration_sum\" em cada diaX.\nAlgumas mensagens de log traduzidas no main.ts\nSet corrigidoStateAsync para setState no main.ts\ncorreção: atualização das horas de previsão de manuseio.\nAdicionamos uma pasta de informações com um ponto de dados last_update para verificar quando a última atualização foi realizada.",
        "nl": "Stikstofdioxide (NO2) -gegevenspunt toegevoegd aan de luchtkwaliteitsgegevens, verzoek van de gebruiker.\nNieuwe datapunten toegevoegd voor \"global_tilted_irradiance\" & \"et0_fao_evapotranspiration\" in uur X en \"et0_fao_evapotranspiration_sum\" in dag X.\nSommige Log-berichten vertaald in main.ts\nGecorrigeerdStateAsync instellenState in main.ts\nfix: update voorspelling uren behandeling.\nEen infomap toegevoegd met een laatste_update-gegevenspunt om te controleren wanneer de laatste update werd uitgevoerd.",
        "fr": "Point de données sur le dioxyde d'azote (NO2) ajouté aux données sur la qualité de l'air, demande de l'utilisateur.\nAjout de nouveaux points de données pour \"global_tilted_irradiance\" & \"et0_fao_evapotranspiration\" en heuresX et \"et0_fao_evapotranspiration_sum\" en joursX.\nQuelques messages de journal traduits dans main.ts\nSet corrigéStateAsync pour définirState dans main.ts\ncorrection: mise à jour de la gestion des heures de prévision.\nAjout d'un dossier info avec un point de données last_update pour vérifier quand la dernière mise à jour a été effectuée.",
        "it": "Anidride carbonica (NO2) datapoint aggiunto ai dati di qualità dell'aria, richiesta dell'utente.\nAggiunto nuovi datapoints per \"global_tilted_irradiance\" & \"et0_fao_evapotranspiration\" in hourlyX e \"et0_fao_evapotranspiration_sum\" in dayX.\nAlcuni messaggi di log tradotti in main.ts\nSet correttoStateAsync per impostareState in main.ts\ncorrezione: aggiornamento ore di gestione previsioni.\nAggiunta una cartella di informazioni con un punto di dati last_update per verificare quando l'ultimo aggiornamento è stato eseguito.",
        "es": "Punto de datos de dióxido de nitrógeno (NO2) añadido a los datos de calidad del aire, solicitud del usuario.\nNuevos puntos de datos añadidos para \"global_tilted_irradiance\" \"et0_fao_evapotranspiration\" en horaX y \"et0_fao_evapotranspiration_sum\" en diariamenteX.\nAlgunos mensajes de registro traducidos en main.ts\nCorregido setStateAsync para establecer el estado en main.ts\nsolucion: actualización de las horas de tratamiento.\nSe agregó una carpeta de información con un punto de datos último_actualizar para comprobar cuando se realizó la última actualización.",
        "pl": "Dwutlenek azotu (NO2) punkt danych dodany do danych dotyczących jakości powietrza, żądanie użytkownika.\nDodano nowe punkty danych dla \"global _ tilted _ irradiance\" & \"et0 _ fao _ evapotranspiration\" w hourlyX i \"et0 _ fao _ evapotranspiration _ sum\" w dailyX.\nNiektóre komunikaty Log- przetłumaczone w main.ts\nPoprawiony setStateAsync do setState w main.ts\nfix: aktualizacja przewidywanych godzin obsługi.\nDodano folder informacyjny z punktem danych last _ update do sprawdzenia, kiedy ostatnia aktualizacja została wykonana.",
        "uk": "Нікооксид азоту (NO2) додано до даних про якість повітря, запит користувача.\nДодано нові точки даних для \"global_tilted_irradiance\" & \"et0_fao_evapotranspiration\" в часіX і \"et0_fao_evapotranspiration_sum\" в щоденному режиміX.\nДеякі лог-повідомлення, перекладені в main.ts\nВиправлено setStateAsync для setState в main.ts\nвиправити: оновити час обробки.\nДодано інформаційну папку з останню_оновленою точкою для перевірки при виконанні останнього оновлення.",
        "zh-cn": "二氧化氮(NO2)数据点加入空气质量数据,用户请求.\n为\"global_tilted_iradiance\"和\"et0_fao_evapotranching\"在小时X和\"et0_fao_evapotranching_sum\"在日X中添加了新的数据点.\n主要.ts翻译的一些日志消息\n更正 set StateAsync 到主.ts 设置状态\n固定:更新预测时间处理.\n添加了信息文件夹, 包含最后的_ 更新数据点, 以检查上次更新何时完成 ."
      },
      "2.2.4": {
        "en": "fix: update snow depth unit from cm to m in metric unit map\nadd: precipitation in hourly & precipitation_sum (snow,rain,showers) in daily.\nImplemented state caching to reduce redundant database I/O operations.\nOptimized socket management with explicit connection handling and timeouts.\nRefactored update logic for better resource management",
        "de": "fix: schneetiefe von cm bis m in metrische einheitskarte aktualisieren\nadd: niederschlag in stündlich & niederschlag_sum (snow,rain,showers) im täglichen.\nErgänzte Zustandscaching, um redundante Datenbank-I/O-Betriebe zu reduzieren.\nOptimiertes Steckdosenmanagement mit explizitem Anschlusshandling und Timeouts.\nRefactored Update-Logik für bessere Ressourcenverwaltung",
        "ru": "исправление: обновление блока глубины снега от см до м на карте метрической единицы\nдобавить: осадки почасовые и осадки_сумма (снег, дождь, душ) ежедневно.\nВнедрение кэширования состояния для сокращения избыточных операций ввода/вывода базы данных.\nОптимизированное управление сокетами с явной обработкой подключения и тайм-аутами.\nРефакторированная логика обновления для лучшего управления ресурсами",
        "pt": "correção: atualizar unidade de profundidade de neve de cm para m no mapa unitário métrico\nadicionar: precipitação em hora & precipitação_sum (neve, chuva, chuveiros) em dia.\nCache de estado implementado para reduzir as operações de E/S de banco de dados redundantes.\nGerenciamento otimizado de soquete com manuseio explícito de conexão e timeouts.\nLógica de atualização refatorada para melhor gerenciamento de recursos",
        "nl": "fix: update sneeuwdiepte eenheid van cm tot m in metrische eenheid kaart\nadd: neerslag in per uur en neerslag_sum (sneeuw, regen, douches) in dagelijks.\nGeïmplementeerde state caching om overbodige database I/O operaties te verminderen.\nGeoptimaliseerd socketbeheer met expliciete aansluitingen en time-outs.\nGerefactoreerde updatelogica voor beter beheer van hulpbronnen",
        "fr": "correctif: mise à jour de l'unité de profondeur de neige de cm à m dans la carte de l'unité métrique\najouter: précipitations en heures et précipitations_somme (neige, pluie, douche) par jour.\nMise en place d'une mise en cache d'état pour réduire les opérations d'E/S de base de données redondantes.\nGestion optimisée des prises avec manipulation explicite des connexions et délais.\nUne nouvelle logique de mise à jour pour une meilleure gestion des ressources",
        "it": "fix: aggiornare l'unità di profondità della neve da cm a m nella mappa dell'unità metrica\naggiungere: precipitazioni in orario & precipitazioni_sum (snow,rain,doccia) in ogni giorno.\nCaching dello stato implementato per ridurre le operazioni di database ridondanti I/O.\nGestione ottimizzata delle prese con gestione esplicita della connessione e timeout.\nLogica di aggiornamento rifatto per una migliore gestione delle risorse",
        "es": "fijado: actualizar unidad de profundidad de nieve de cm a m en el mapa de unidad métrica\nañadir: precipitación en hora \" precipitation_sum (snow,rain,showers) en diario.\nCaché estatal implementado para reducir las operaciones de base de datos I/O redundantes.\nOptimizada gestión de tomas con manejo de conexión explícito y timeouts.\nLógica de actualización refactorizada para mejorar la gestión de los recursos",
        "pl": "fix: aktualizacja jednostki głębokości śniegu od cm do m na mapie jednostki metrycznej\ndodać: opady w godzinowym i opadów _ sumy (śnieg, deszcz, prysznice) w ciągu dnia.\nWdrożenie buforowania stanu w celu zmniejszenia zbędnej bazy danych I / O.\nZoptymalizowane zarządzanie gniazdem z wyraźną obsługą połączeń i timeout.\nZmieniona logika aktualizacji dla lepszego zarządzania zasobami",
        "uk": "виправити: оновити глибинний блок снігу від см до м в метричній одиниці карті\nдодайте: опади в часті та опади_сума (сніго, стримані, шоуери) щодня.\nВпровадження державного кешування для зменшення надмірної бази даних I/O операцій.\nОптимізоване управління розетками з використанням чіткого з'єднання та своєчасності.\nРефакторна логіка оновлення для кращого управління ресурсами",
        "zh-cn": "固定: 将测量单位地图中的雪深单位从 cm 更新到 m\n加:每日以小时和降水量(雪,雨,雨)计.\n执行状态缓存以减少冗余数据库一/O操作.\n优化套接字管理,明确连接处理和超时.\n改进资源管理的更新逻辑"
      },
      "2.2.3": {
        "en": "Fix: In the hourly forecast, all hours were incorrectly inheriting the date from the last \"day\".*\nFix: Corrected name_day for day0. Previously, it was hardcoded as \"Today\" (a legacy remnant). It now correctly displays the actual day of the week.\nUpdated hours*: Split date and time into separate data points (\"date\" and \"time\") based on user feedback.\nAdded 'date' key with translations to all translation files.",
        "de": "Fix: In der Stundenprognose wurden alle Stunden vom letzten \"Tag\" falsch vererbt. *\nFix: Korrigiert name_day für day0. Zuvor war es als \"Today\" (ein Vermächtnis-Remnant) schwercodiert. Es zeigt jetzt korrekt den tatsächlichen Tag der Woche.\nAktualisierte Stunden*: Datum und Uhrzeit in separate Datenpunkte (\"Datum\" und \"Zeit\") auf Basis von Nutzerfeedback teilen.\nHinzugefügt 'date' Schlüssel mit Übersetzungen in alle Übersetzungsdateien.",
        "ru": "В почасовом прогнозе все часы неправильно наследовали дату от последнего «дня». *\nИсправленное имя_day для day0. Ранее он был жестко закодирован как «Сегодня» (наследный остаток). Теперь он правильно отображает фактический день недели.\nОбновленные часы *: Разделите дату и время на отдельные точки данных («дата» и «время») на основе обратной связи с пользователем.\nДобавлен ключ «дата» с переводами на все файлы перевода.",
        "pt": "Correção: Na previsão horária, todas as horas estavam incorretamente herdando a data do último \"dia\". *\nCorrigir: Corrigido nome_dia para dia0. Anteriormente, foi codificado como \"Today\" (um remanescente legado). Ele agora exibe corretamente o dia real da semana.\nHorários atualizados*: Dividir data e hora em pontos de dados separados (\"data\" e \"tempo\") com base no feedback do usuário.\nAdicionado 'data' chave com traduções para todos os arquivos de tradução.",
        "nl": "Fix: In de uurverwachting erven alle uren de datum van de laatste \"dag.\" *\nFix: Gecorrigeerde naam_dag voor dag0. Voorheen was het hardgecodeerd als \"Today\" (een overblijfsel van een nalatenschap). Het toont nu correct de werkelijke dag van de week.\nBijgewerkte uren*: Splits datum en tijd in afzonderlijke datapunten (\"datum\" en \"tijd\") op basis van feedback van de gebruiker.\nToegevoegd 'datum' sleutel met vertalingen naar alle vertaalbestanden.",
        "fr": "Correction : Dans la prévision horaire, toutes les heures héritent incorrectement de la date du dernier « jour ». *\nCorrection : Correction de name_day pour day0. Auparavant, il était codé en dur comme \"Aujourd'hui\" (un reste de l'héritage). Il affiche maintenant correctement le jour réel de la semaine.\nMise à jour des heures* : fractionner la date et l'heure en points de données distincts (« date » et « heure ») en fonction des commentaires des utilisateurs.\nAjout de la clé 'date' avec des traductions dans tous les fichiers de traduction.",
        "it": "Fisso: Nelle previsioni orarie, tutte le ore sono state eredite erroneamente la data dall'ultimo \"giorno\". #\nCorretto: Nome corretto_giorno per day0. In precedenza, è stato codificato come \"oggi\" (un residuo legacy). Ora visualizza correttamente il giorno effettivo della settimana.\nOre aggiornate*: Dividi la data e l'ora in punti di dati separati (\"date\" e \"time\") basati sul feedback degli utenti.\nAggiunto 'data' chiave con traduzioni a tutti i file di traduzione.",
        "es": "Fijación: En el pronóstico por hora, todas las horas heredaron incorrectamente la fecha del último \"día\". *\nCorregido nombre_día por día0. Anteriormente, se codificaba como \"Hoy\" (un remanente legado). Ahora correctamente muestra el día real de la semana.\nHoras actualizadas*: Dividir fecha y hora en puntos de datos separados (\"fecha\" y \"tiempo\") basados en la retroalimentación del usuario.\nAñadido 'fecha' clave con traducciones a todos los archivos de traducción.",
        "pl": "Fix: W prognozie godzinowej wszystkie godziny nieprawidłowo dziedziczyły datę z ostatniego \"dnia\". *\nFix: Skorygowana nazwa _ day na dzień 0. Wcześniej oznaczono go jako \"Today\" (pozostałość po sobie). Teraz poprawnie wyświetla rzeczywisty dzień tygodnia.\nZaktualizowane godziny *: Podziel datę i czas na oddzielne punkty danych (\"data\" i \"czas\") w oparciu o opinie użytkowników.\nDodano klucz 'date' z tłumaczeniami do wszystkich plików tłumaczeniowych.",
        "uk": "Виправлення: У часовому прогнозі всі години некоректно успадкували дату з останнього «день». Ім'я *\nВиправлено: Виправлено ім'я_day для day0. По-перше, він був твердийкодований як \"Для\" (відкладений спадок). В даний час правильно відображається фактичний день тижня.\nОновлено години*: Час розщеплення та час на окремі пункти даних (\"дата\" та \"час\") на основі відгуків користувачів.\nДодано ключ \"date\" з перекладами на всі файли перекладу.",
        "zh-cn": "Fix:在小时预报中,所有小时都错误地继承了上一个\"日\"的日期. * 《大会正式记录,第五十八届会议,补编第5号》(A/C.6/61/Rev.1)\n修补:更正名称_天为日. 此前,它被硬编码为\"今天\"(一种遗存). 它现在正确显示这个星期的实际一天.\n更新小时*:根据用户反馈将日期和时间分成独立的数据点(\"日期\"和\"时间\").\n添加带有翻译的“ 日期” 密钥到所有翻译文件 ."
      },
      "2.2.2": {
        "en": "fix: update js-controller and admin dependencies to latest versions\nfix: add missing responsive breakpoints in jsonConfig\nfix: Chinese translations files & correct import path for Chinese translations\nfix: add missing translation for precipitation probability to the translations\nfix: Adjusted the creation of hourly state icons to account for day/night conditions.\nadd: Added debug logs to track the execution flow and data processing for better traceability.\nEnhance performance and readability by caching translations, unit maps, and imperial settings.\nRefactor icon retrieval methods for wind direction and moon phases, optimize cleanup logic for deleted locations, improve state creation and updating with consistent translation handling.",
        "de": "fix: update von js-controller und adminabhängigkeiten auf neueste versionen\nfix: Hinzufügen fehlender reaktionsschneller Breakpoints in jsonConfig\nfix: Chinesische Übersetzungen Dateien & korrekter Importpfad für chinesische Übersetzungen\nfix: fügen sie fehlende übersetzung für die fällungswahrscheinlichkeit zu den übersetzungen hinzu\nfix: Die Erstellung von stündlichen Zustandssymbolen angepasst, um Tag/Nacht-Bedingungen zu berücksichtigen.\nadd: Debug-Logs hinzugefügt, um den Ausführungsablauf und die Datenverarbeitung für eine bessere Rückverfolgbarkeit zu verfolgen.\nVerbessern Sie die Leistung und Lesbarkeit durch Cache-Übersetzungen, Unit-Karten und imperiale Einstellungen.\nRefactor-Icon-Retrieval-Methoden für Windrichtung und Mondphasen, Optimieren Sie die Aufräumlogik für gelöschte Standorte, verbessern Sie die Zustandserstellung und aktualisieren Sie mit konsequentem Übersetzungshandling.",
        "ru": "исправление: обновление js-контроллера и зависимостей администратора в последних версиях\nисправить: добавить недостающие адаптивные точки останова в jsonConfig\nисправление: файлы китайских переводов и правильный путь импорта для китайских переводов\nисправить: добавить недостающий перевод для вероятности осадков к переводам\nисправление: скорректировано создание почасовых государственных икон для учета условий дня / ночи.\nдобавлены журналы отладки для отслеживания потока выполнения и обработки данных для лучшей прослеживаемости.\nПовышение производительности и читаемости путем кэширования переводов, карт единиц и имперских настроек.\nРефакторные методы поиска значков для ветровой и лунной фаз, оптимизация логики очистки для удаленных мест, улучшение создания состояния и обновление с последовательной обработкой перевода.",
        "pt": "corrigir: atualizar js-controller e dependências de administração para versões mais recentes\ncorreção: adicionar pontos de paragem em falta no jsonConfig\ncorreção: arquivos de traduções chinesas e caminho de importação correto para traduções chinesas\ncorrigir: adicionar tradução faltando para probabilidade de precipitação para as traduções\ncorreção: Ajustou a criação de ícones de estado horário para contabilizar as condições do dia/noite.\nadd: Adicionado registros de depuração para rastrear o fluxo de execução e processamento de dados para melhor rastreabilidade.\nMelhore o desempenho e a legibilidade através do cache de traduções, mapas unitários e configurações imperiais.\nMétodos de recuperação de ícones de refator para as fases de direção do vento e lua, otimizar a lógica de limpeza para locais excluídos, melhorar a criação de estado e atualização com o manuseio consistente da tradução.",
        "nl": "fix: update js-controller en admin afhankelijkheden van de nieuwste versies\nfix: voeg ontbrekende responsieve breekpunten in jsonConfig toe\nfix: Chinese vertalingen bestanden en juiste import pad voor Chinese vertalingen\nfix: voeg ontbrekende vertaling voor neerslag waarschijnlijkheid aan de vertalingen\nfix: De aanmaak van pictograms per uur aangepast om rekening te houden met dag-/nachtomstandigheden.\nadd: Toegevoegd debug logs om de uitvoering stroom en gegevensverwerking te volgen voor een betere traceerbaarheid.\nVerbeter de prestaties en leesbaarheid door caching vertalingen, eenheidskaarten en keizerlijke instellingen.\nRefactor pictogram retrieval methoden voor windrichting en maanfasen, optimaliseren opruimlogica voor verwijderde locaties, verbeteren staat creatie en bijwerken met consistente vertaling handling.",
        "fr": "correction: mettre à jour js-controller et les dépendances administratives aux dernières versions\ncorrection : ajouter des points d'arrêt réactifs manquants dans jsonConfig\ncorrection: fichiers de traductions chinoises & chemin d'importation correct pour les traductions chinoises\ncorrection: ajouter la traduction manquante pour la probabilité de précipitation aux traductions\ncorrection : Ajusté la création d'icônes de l'état horaire pour tenir compte des conditions de jour/nuit.\najouter: Ajout de journaux de débogage pour suivre le flux d'exécution et le traitement des données pour une meilleure traçabilité.\nAméliorer les performances et la lisibilité en cachant les traductions, les cartes unitaires et les paramètres impériaux.\nRefactor méthodes de récupération d'icônes pour la direction du vent et les phases de lune, optimiser la logique de nettoyage pour les emplacements supprimés, améliorer la création d'état et la mise à jour avec la gestion cohérente de la traduction.",
        "it": "correzione: aggiornamento js-controller e dipendenze di amministrazione alle ultime versioni\nfix: aggiungere i breakpoint mancanti in jsonConfig\nfix: Traduzioni cinesi file e corretto percorso di importazione per traduzioni cinesi\ncorrezione: aggiungere la traduzione mancante per la probabilità di precipitazioni alle traduzioni\nfix: Regolata la creazione di icone di stato oraria per tenere conto delle condizioni di giorno/notte.\naggiungere: Aggiunti tronchi debug per monitorare il flusso di esecuzione e l'elaborazione dei dati per una migliore tracciabilità.\nMigliorare le prestazioni e la leggibilità tramite traduzioni di cache, mappe unità e impostazioni imperiali.\nI metodi di recupero dell'icona del refattore per la direzione del vento e le fasi lunari, ottimizzare la logica di pulizia per le posizioni eliminate, migliorare la creazione dello stato e l'aggiornamento con la gestione coerente della traduzione.",
        "es": "fijación: actualización js-controller y dependencias de administración a las últimas versiones\nfijación: añadir puntos de rotura no deseados en jsonConfig\nfijación: traducciones chinas archivos \" camino de importación correcto para traducciones chinas\nsolución: añadir traducción faltante para la probabilidad de precipitación a las traducciones\nfijación: Ajustó la creación de iconos de estado por hora para tener en cuenta las condiciones del día/noche.\nañadir: Registros de depuración añadidos para rastrear el flujo de ejecución y el procesamiento de datos para una mejor trazabilidad.\nMejorar el rendimiento y la legibilidad mediante traducciones de caché, mapas de unidad y ajustes imperiales.\nRefactor icono métodos de recuperación para la dirección eólica y fases lunares, optimizar la lógica de limpieza para ubicaciones eliminadas, mejorar la creación del estado y actualizar con el manejo de traducción consistente.",
        "pl": "fix: update js- controller i zależności admin do najnowszych wersji\nfix: dodaj brakujące punkty zwrotne w jsonConfig\nfix: Chińskie tłumaczenia plików i poprawna ścieżka importu dla chińskich tłumaczeń\nfix: dodać brak tłumaczenia na prawdopodobieństwo opadów do tłumaczenia\nfix: Dostosował tworzenie ikon stanu godzinowego do warunków dnia / nocy.\ndodaj: Dodano logi debugowania do śledzenia przepływu wykonania i przetwarzania danych dla lepszej identyfikowalności.\nZwiększenie wydajności i czytelności poprzez buforowanie tłumaczeń, map jednostkowych i ustawień imperialnych.\nRefactor metody pobierania ikon dla kierunku wiatru i fazy Księżyca, zoptymalizować logikę czyszczenia dla usuniętych lokalizacji, poprawić tworzenie stanu i aktualizację ze spójną obsługą tłumaczenia.",
        "uk": "виправити: оновити js-controller і адміністратор залежності до останніх версій\nвиправити: додати відсутні чуйні точки розриву в jsonConfig\nвиправити: Китайські переклади файлів та правильний шлях імпорту для китайських перекладів\nвиправити: додавати відсутній переклад для ймовірності опадів до перекладів\nфіксувати: регулювати створення часових державних ікон до облікового запису на день / нічні умови.\nдодати: Додано дебвугові колоди для відстеження потоку виконання та обробки даних для кращої мікроелементності.\nПідвищення продуктивності та читабельності за допомогою кешування перекладів, блокових карт та налаштування імперських.\nРефакторні іконки ретривальні методи для вітрового напрямку та місячних фази, оптимізують логіку очищення для видалених локацій, покращують стан створення та оновлення з послідовним перекладом.",
        "zh-cn": "固定: 更新 js 控制器和对最新版本的依赖性\n固定: 在 jsonConfig 中添加缺失的响应断点\n修补:中文翻译文件及中文翻译的正确导入路径\n修补: 在翻译中添加缺少的降水概率翻译\n固定 : 调整了小时状态图标的创建,以反映日/夜条件.\n加:添加调试日志以跟踪执行流程和数据处理,以更好的可追溯性.\n通过缓存翻译、单位地图和帝国设置提高性能和可读性.\n重构风向和月相的图标检索方法,优化被删除位置的清理逻辑,改进状态创建,并采用一致的翻译处理方式进行更新."
      }
    },
    "titleLang": {
      "en": "Open-Meteo Weather Service",
      "de": "Open-Meteo Wetterdienst",
      "ru": "Прогноз погоды Open-Meteo",
      "pt": "Serviço de Meteorologia Open-Meteo",
      "nl": "Open-Meteo weerdienst",
      "fr": "Service météo Open-Meteo",
      "it": "Servizio meteo Open-Meteo",
      "es": "Servicio Meteorológico Open-Meteo",
      "pl": "Serwis pogodowy Open-Meteo",
      "uk": "Метеорологічна служба Open-Meteo",
      "zh-cn": "Open-Meteo 天气服务"
    },
    "desc": {
      "en": "Get local weather, air quality and pollen data from Open-Meteo.com",
      "de": "Lokale Wetter-, Luftqualitäts- und Pollenflugdaten von Open-Meteo.com abrufen",
      "ru": "Получайте данные о местной погоде, качестве воздуха и пыльце с сайта Open-Meteo.com",
      "pt": "Obtenha dados meteorológicos locais, qualidade do ar e pólen de Open-Meteo.com",
      "nl": "Ontvang lokale weers-, luchtkwaliteits- en pollengegevens van Open-Meteo.com",
      "fr": "Obtenez les prévisions météo locales, la qualité de l'air et les données sur le pollen d'Open-Meteo.com",
      "it": "Ottieni meteo locale, qualità dell' dell'aria e dati sui pollini da Open-Meteo.com",
      "es": "Obtenga datos meteorológicos locales, calidad del aire y polen de Open-Meteo.com",
      "pl": "Pobieraj lokalne dane pogodowe, jakość powietrza i dane o pyłkach z Open-Meteo.com",
      "uk": "Отримуйте дані про місцеву погоду, якість повітря та пилок з Open-Meteo.com",
      "zh-cn": "从 Open-Meteo.com 获取当地天气、空气质量 and 花粉数据"
    },
    "authors": [
      "H5N1v2 <h5n1@iknox.de>"
    ],
    "keywords": [
      "weather",
      "forecast",
      "open-meteo",
      "pollen",
      "air quality"
    ],
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "type": "weather",
    "mode": "daemon",
    "platform": "Javascript/Node.js",
    "icon": "open-meteo.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/H5N1v2/ioBroker.open-meteo-weather/main/admin/open-meteo.png",
    "readme": "https://github.com/H5N1v2/ioBroker.open-meteo-weather/blob/main/README.md",
    "loglevel": "info",
    "tier": 3,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "latitude": 51.34,
    "longitude": 12.37,
    "interval": 30,
    "pollenEnabled": true,
    "airQualityEnabled": false,
    "language": "de",
    "forecastDays": 1,
    "forecastHours": 1,
    "forecastHoursEnabled": false,
    "locations": []
  }
}
